In [ ]:
# 분류 예습

In [1]:
from sklearn.linear_model import LogisticRegression

In [2]:
from sklearn.ensemble import RandomForestClassifier

In [3]:
from sklearn.svm import SVC

In [4]:
from sklearn.svm import SVR

In [5]:
from sklearn.neighbors import KNeighborsClassifier

In [6]:
from sklearn.tree import DecisionTreeClassifier

In [7]:
from sklearn.naive_bayes import GaussianNB

In [8]:
from sklearn.model_selection import train_test_split

In [9]:
from sklearn.metrics import accuracy_score

In [29]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
import seaborn as sns

In [14]:
pd.read_csv('C:/ex/data/titanic.csv')

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

In [15]:
df=pd.read_csv('C:/ex/data/titanic.csv')

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [17]:
df.describe()

       PassengerId    Survived      Pclass  ...       SibSp       Parch        Fare
count   891.000000  891.000000  891.000000  ...  891.000000  891.000000  891.000000
mean    446.000000    0.383838    2.308642  ...    0.523008    0.381594   32.204208
std     257.353842    0.486592    0.836071  ...    1.102743    0.806057   49.693429
min       1.000000    0.000000    1.000000  ...    0.000000    0.000000    0.000000
25%     223.500000    0.000000    2.000000  ...    0.000000    0.000000    7.910400
50%     446.000000    0.000000    3.000000  ...    0.000000    0.000000   14.454200
75%     668.500000    1.000000    3.000000  ...    1.000000    0.000000   31.000000
max     891.000000    1.000000    3.000000  ...    8.000000    6.000000  512.329200

[8 rows x 7 columns]

In [18]:
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [19]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [21]:
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [58]:
sns.load_dataset('titanic')

     survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0           0       3    male  22.0  ...   NaN  Southampton     no  False
1           1       1  female  38.0  ...     C    Cherbourg    yes  False
2           1       3  female  26.0  ...   NaN  Southampton    yes   True
3           1       1  female  35.0  ...     C  Southampton    yes  False
4           0       3    male  35.0  ...   NaN  Southampton     no   True
..        ...     ...     ...   ...  ...   ...          ...    ...    ...
886         0       2    male  27.0  ...   NaN  Southampton     no   True
887         1       1  female  19.0  ...     B  Southampton    yes   True
888         0       3  female   NaN  ...   NaN  Southampton     no  False
889         1       1    male  26.0  ...     C    Cherbourg    yes   True
890         0       3    male  32.0  ...   NaN   Queenstown     no   True

[891 rows x 15 columns]

In [59]:
titanic_df=sns.load_dataset('titanic')

In [60]:
titanic_df.isna().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [61]:
titanic_df['deck']

0      NaN
1        C
2      NaN
3        C
4      NaN
      ...
886    NaN
887      B
888    NaN
889      C
890    NaN
Name: deck, Length: 891, dtype: category
Categories (7, object): ['A', 'B', 'C', 'D', 'E', 'F', 'G']

In [38]:
titanic_df['deck'].value_counts()

deck
C    59
B    47
D    33
E    32
A    15
F    13
G     4
Name: count, dtype: int64

In [ ]:
titanic_df['deck'].value_counts(dropna=False)   #결측치도 같이 새는 dropna=False

deck
NaN    688
C       59
B       47
D       33
E       32
A       15
F       13
G        4
Name: count, dtype: int64

In [40]:
tit_df=titanic_df['deck'].value_counts(dropna=False)

In [41]:
tit_df

deck
NaN    688
C       59
B       47
D       33
E       32
A       15
F       13
G        4
Name: count, dtype: int64

In [42]:
tit_df.sum()

np.int64(891)

In [43]:
tit_df

deck
NaN    688
C       59
B       47
D       33
E       32
A       15
F       13
G        4
Name: count, dtype: int64

In [ ]:
# 결측값 관련 인식(0, False, '', None, null, NA, Nan)

In [44]:
tit_df

deck
NaN    688
C       59
B       47
D       33
E       32
A       15
F       13
G        4
Name: count, dtype: int64

In [45]:
titanic_df.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [46]:
titanic_df.isnull().sum(axis=1)

0      1
1      0
2      1
3      0
4      1
      ..
886    1
887    0
888    2
889    0
890    1
Length: 891, dtype: int64

In [ ]:
titanic_df.dropna(axis=1)   #결측치 날리기

     survived  pclass     sex  sibsp  ...    who  adult_male alive  alone
0           0       3    male      1  ...    man        True    no  False
1           1       1  female      1  ...  woman       False   yes  False
2           1       3  female      0  ...  woman       False   yes   True
3           1       1  female      1  ...  woman       False   yes  False
4           0       3    male      0  ...    man        True    no   True
..        ...     ...     ...    ...  ...    ...         ...   ...    ...
886         0       2    male      0  ...    man        True    no   True
887         1       1  female      0  ...  woman       False   yes   True
888         0       3  female      1  ...  woman       False    no  False
889         1       1    male      0  ...    man        True   yes   True
890         0       3    male      0  ...    man        True    no   True

[891 rows x 11 columns]

In [62]:
titanic_df.dropna(axis=1, thresh=500, inplace=True)

In [63]:
titanic_df.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'embark_town', 'alive',
       'alone'],
      dtype='object')

In [ ]:
# 결측치 삭제 후에는 항상 정확하게 행(row)과 열(columns)의 갯수가 맞는지 반드시 확인

In [64]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 14 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  embark_town  889 non-null    object
 12  alive        891 non-null    object
 13  alone        891 non-null    bool
dtypes: bool(2), category(1), float64(2), int64(4), object(5)
memory usage: 79.4+ KB

In [53]:
891 - 714

177

In [65]:
titanic_df['age'].isna().sum()

np.int64(177)

In [87]:
titanic_df.dropna(subset=['age'], axis=0, inplace=True)

In [88]:
titanic_df['age'].mean()

np.float64(29.69911764705882)

In [89]:
mean_age=titanic_df['age'].mean()

In [98]:
titanic_df['age'].fillna(mean_age, inplace=True)

C:\Users\User\AppData\Local\Temp\ipykernel_5224\3419352568.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  titanic_df['age'].fillna(mean_age, inplace=True)

In [70]:
titanic_df['embark_town']

0      Southampton
1        Cherbourg
2      Southampton
3      Southampton
4      Southampton
          ...
886    Southampton
887    Southampton
888    Southampton
889      Cherbourg
890     Queenstown
Name: embark_town, Length: 891, dtype: object

In [71]:
titanic_df['embark_town'].isna().sum()

np.int64(2)

In [74]:
titanic_df['embark_town'].value_counts()

embark_town
Southampton    644
Cherbourg      168
Queenstown      77
Name: count, dtype: int64

In [75]:
titanic_df['embark_town'].unique()

array(['Southampton', 'Cherbourg', 'Queenstown', nan], dtype=object)

In [76]:
titanic_df.mode()

   survived  pclass   sex   age  ...  adult_male  embark_town  alive alone
0         0       3  male  24.0  ...        True  Southampton     no  True

[1 rows x 14 columns]

In [78]:
titanic_df['embark_town'].mode()[0]

'Southampton'

In [ ]:
titanic_df['embark_town'].value_counts().idxmax()   # 가장 최댓갑인 것을 출력

'Southampton'

In [83]:
most_freq=titanic_df['embark_town'].mode()[0]

In [84]:
titanic_df['embark_town'].fillna('Southampton', inplace=True)

In [85]:
titanic_df['embark_town']

0      Southampton
1        Cherbourg
2      Southampton
3      Southampton
4      Southampton
          ...
886    Southampton
887    Southampton
888    Southampton
889      Cherbourg
890     Queenstown
Name: embark_town, Length: 891, dtype: object

In [99]:
np.sqrt(5**2+12**2)

np.float64(13.0)

In [100]:
np.sqrt(9**2+12**2)

np.float64(15.0)

In [ ]:
from collections import deque

In [2]:
deque_list = deque()

In [9]:
for i in range(5):
    deque_list.append(i)

In [10]:
print(deque_list)

deque([0, 1, 2, 3, 4])

In [11]:
deque_list.pop()

4

In [12]:
deque_list.pop()

3

In [13]:
deque_list.pop()

2

In [14]:
deque_list

deque([0, 1])

In [15]:
deque_list = deque()
for i in range(5):
    deque_list.appendleft(i)

In [16]:
print(deque_list)

deque([4, 3, 2, 1, 0])

In [17]:
deque_list = deque()

In [ ]:
for i in range(5):
    deque_list.appendleft(i)

In [20]:
deque_list

deque([4, 3, 2, 1, 0])

In [22]:
print(deque(reversed(deque_list)))

deque([0, 1, 2, 3, 4])

In [30]:
from collections import deque
deque_list = deque(['a', 'b', 'c'])

In [24]:
deque_list

deque(['a', 'b', 'c'])

In [25]:
deque_list.rotate(1)
print(deque_list)

deque(['c', 'a', 'b'])

In [31]:
deque_list.rotate(-2)
print(deque_list)

deque(['c', 'a', 'b'])

In [27]:
deque_list.appendleft('c')
print(deque_list)

deque(['c', 'b', 'c', 'a'])

In [28]:
deque_list = deque(['c', 'a', 'b'])
print(deque_list)

deque(['c', 'a', 'b'])

In [29]:
deque_list = deque(['a', 'b', 'c'])
print(deque_list)

deque(['a', 'b', 'c'])

In [32]:
dictionary = {"a": 1, "b": 2, "c": 3}

In [33]:
dictionary.setdefault( 'b', 4 ) 
dictionary.setdefault( 'd', 5 )

5

In [ ]:
dictionary["c"]  = dictionary["d"]

In [35]:
dictionary["c"]

5

In [36]:
dictionary["d"]

5

In [37]:
fruits = ('apple','banana','cherry','strawberry')

In [38]:
3**5

243

In [ ]:
# 불가능(immuratable)

In [39]:
country_code={"America":1,"Korea":82,"China":86,"Japan":81}

In [40]:
country_code.values()

dict_values([1, 82, 86, 81])

In [48]:
a=0
midterm_set = set([1, 5, 7, 4, 3, 2, 1, 1, 2, 3])

In [49]:
for i in midterm_set:
    a = a+i
print(a)

22

In [50]:
def delete_a_list_element(list_data, element_value):
    if element_value in list_data:
        list_data.remove(element_value)
        return list_data
    else:
        return "False"

In [51]:
list_data = ['a', 1, 'gachon', '2016.0']

In [52]:
list_data

['a', 1, 'gachon', '2016.0']

In [53]:
element = float(2016)

In [54]:
result = delete_a_list_element(list_data, element)

In [55]:
element

2016.0

In [57]:
print(result)

False

In [58]:
def add_number(original_list):
    original_list += [1]

In [59]:
mylist = [1, 2, 3, 4]

In [60]:
add_number(mylist)

In [61]:
mylist

[1, 2, 3, 4, 1]

In [ ]:
print(set(mylist))   # set은 중괄호

{1, 2, 3, 4}

In [ ]:
a = [3, "apple", 2016, 4]
b = a.pop(0)     # [3]
c = a.pop(1)     # [2016]       ['apple',2016,4]
print(b + c)

2019

In [ ]:
def week_seven(sentence1):
    cells = set(sentence1.replace(' ','').lower())    #
    return cells

In [66]:
sentence_a = "The quick brown fox jumps over the lazy dog"
sentence_b = "I love you"    
print(len(week_seven(sentence_a)-week_seven(sentence_b)))

19

In [88]:
def test(num): 
    if num == 1:
        return True
    elif num == 2:
        return False
    else:
        print('1과 2만 넣으세요')

In [89]:
result1=test(1)
result2=test(2)
result3=test(3)
print(result1,result2,result3)

1과 2만 넣으세요
True False None

In [90]:
tuple_1 = (1, 2, 3)
tuple_2 = (4, 5, 6)

In [91]:
tuple_1 + tuple_2

(1, 2, 3, 4, 5, 6)

In [92]:
dict_1 = {2:1, 4:2, 6:3, 8:4, 10:6}

In [93]:
dict_keys = list(dict_1.keys())
dict_values = list(dict_1.values())

In [96]:
dict_keys

[2, 4, 6, 8, 10]

In [97]:
dict_values

[1, 2, 3, 4, 6]

In [94]:
dict_2 = dict()

In [95]:
for i in range(len(dict_keys)):
    dict_2[dict_values[i]] = dict_keys[i]